In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
obj=pd.Series([4,7,-5,3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [8]:
obj3 = pd.Series(sdata)

In [9]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [10]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [11]:
obj4 = pd.Series(sdata, index=states)

In [12]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [13]:
 pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [14]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [16]:
obj4.name='Population'

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [18]:
obj.index=['Shaz','Tazzy','Hanzi','Anda']

In [19]:
obj

Shaz     4
Tazzy    7
Hanzi   -5
Anda     3
dtype: int64

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [21]:
frame=pd.DataFrame(data)

In [22]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [26]:
 frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                       index=['one', 'two', 'three', 'four','five', 'six'])

In [27]:
frame2.debt=range(1,7)

In [28]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5
six    2003  Nevada  3.2     6

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2.loc['one':'three']

       year state  pop  debt
one    2000  Ohio  1.5     1
two    2001  Ohio  1.7     2
three  2002  Ohio  3.6     3

In [33]:
frame.iloc[3:5]

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [34]:
 frame2['debt'] = 16.5

In [35]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [36]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [38]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [39]:
del frame2['eastern']

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [41]:
frame2.loc['one':'three':2]   #Yeh column ko khaa jata hai haraami saala.

       year state  pop  debt
one    2000  Ohio  1.5   NaN
three  2002  Ohio  3.6   NaN

In [42]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [43]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [45]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [46]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [47]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [48]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [49]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [51]:
frame2['eastern'] = ["Pass" if i == "Ohio" else "Fail" for i in frame2.state]
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    Pass
two    2001    Ohio  1.7  -1.2    Pass
three  2002    Ohio  3.6   NaN    Pass
four   2001  Nevada  2.4  -1.5    Fail
five   2002  Nevada  2.9  -1.7    Fail
six    2003  Nevada  3.2   NaN    Fail

In [52]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [53]:
Marksheet = {'Roll no.': [1,2,3,4,5],
            'Names': ['Shaz','Tazzy','Hanzi','Anda','Shahzaib'],
            'D.E': [50,60,70,80,90],
            'DBMS': [99,78,67,56,64],
            'Dcom': [78,67,98,86,57],
            'Total': [300,300,300,300,300]}

In [54]:
frame4 = pd.DataFrame(Marksheet)
frame4

   Roll no.     Names  D.E  DBMS  Dcom  Total
0         1      Shaz   50    99    78    300
1         2     Tazzy   60    78    67    300
2         3     Hanzi   70    67    98    300
3         4      Anda   80    56    86    300
4         5  Shahzaib   90    64    57    300

In [55]:
frame4['Obtained Marks']= frame4['D.E']+frame4['DBMS']+frame4['Dcom']

In [56]:
frame4

   Roll no.     Names  D.E  DBMS  Dcom  Total  Obtained Marks
0         1      Shaz   50    99    78    300             227
1         2     Tazzy   60    78    67    300             205
2         3     Hanzi   70    67    98    300             235
3         4      Anda   80    56    86    300             222
4         5  Shahzaib   90    64    57    300             211

In [57]:
frame4['Percentage'] = frame4['Obtained Marks'] / frame4['Total']*100

In [58]:
frame4

   Roll no.     Names  D.E  DBMS  Dcom  Total  Obtained Marks  Percentage
0         1      Shaz   50    99    78    300             227   75.666667
1         2     Tazzy   60    78    67    300             205   68.333333
2         3     Hanzi   70    67    98    300             235   78.333333
3         4      Anda   80    56    86    300             222   74.000000
4         5  Shahzaib   90    64    57    300             211   70.333333

In [59]:
frame4['Remarks'] = ["Pass" if i >= 50 else "Fail" for i in frame4.Percentage]

In [60]:
frame4

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks
0,1,Shaz,50,99,78,300,227,75.666667,Pass
1,2,Tazzy,60,78,67,300,205,68.333333,Pass
2,3,Hanzi,70,67,98,300,235,78.333333,Pass
3,4,Anda,80,56,86,300,222,74.000000,Pass
4,5,Shahzaib,90,64,57,300,211,70.333333,Pass

In [61]:
frame4['Grade'] = ["A" if i>=80 else
                   "B" if i<80 and i>=70 else
                   "C" if i<70 and i>=60 else
                   "D" if i<60 and i>=50 else
                   "F" for i in frame4.Percentage]

In [62]:
frame4.Percentage = [str(j) + "%" for j in frame4.Percentage]

In [63]:
frame4

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
0,1,Shaz,50,99,78,300,227,75.66666666666667%,Pass,B
1,2,Tazzy,60,78,67,300,205,68.33333333333333%,Pass,C
2,3,Hanzi,70,67,98,300,235,78.33333333333333%,Pass,B
3,4,Anda,80,56,86,300,222,74.0%,Pass,B
4,5,Shahzaib,90,64,57,300,211,70.33333333333334%,Pass,B

In [64]:
frame4.T

,0,1,2,3,4
Roll no.,1,2,3,4,5
Names,Shaz,Tazzy,Hanzi,Anda,Shahzaib
D.E,50,60,70,80,90
DBMS,99,78,67,56,64
Dcom,78,67,98,86,57
Total,300,300,300,300,300
Obtained Marks,227,205,235,222,211
Percentage,75.66666666666667%,68.33333333333333%,78.33333333333333%,74.0%,70.33333333333334%
Remarks,Pass,Pass,Pass,Pass,Pass
Grade,B,C,B,B,B

In [65]:
frame4

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
0,1,Shaz,50,99,78,300,227,75.66666666666667%,Pass,B
1,2,Tazzy,60,78,67,300,205,68.33333333333333%,Pass,C
2,3,Hanzi,70,67,98,300,235,78.33333333333333%,Pass,B
3,4,Anda,80,56,86,300,222,74.0%,Pass,B
4,5,Shahzaib,90,64,57,300,211,70.33333333333334%,Pass,B

In [66]:
frame4.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
 obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [68]:
index = obj.index

In [69]:
index

Index(['a', 'b', 'c'], dtype='object')

In [70]:
 index[1:]

Index(['b', 'c'], dtype='object')

In [71]:
 labels = pd.Index(np.arange(3))

In [72]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [73]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [74]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [75]:
 obj2.index is labels

True

In [76]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [77]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [78]:
'Ohio' in frame3.columns

True

In [79]:
 2003 in frame3.index

False

In [80]:
 dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [81]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [82]:
 obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [83]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [85]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [86]:
 obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [87]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [88]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [89]:
 frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [90]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [91]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [92]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [93]:
 states = ['Texas', 'Utah', 'California']

In [94]:
 frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [95]:
 frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\Shahzaib\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [96]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [97]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [98]:
 new_obj = obj.drop('c')

In [99]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [100]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [101]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
 data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
 data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [105]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [106]:
obj.drop('c', inplace=True)

In [107]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [323]:
 obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [324]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [325]:
 obj['b']

1.0

In [329]:
 obj[1]

1.0

In [330]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [331]:
 obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [332]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [333]:
 obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [334]:
 obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [335]:
 obj['b':'c'] = 5

In [336]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [337]:
 frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [338]:
frame

               b         d         e
Utah    0.429065 -0.067477  1.174635
Ohio    0.219946  1.952375  1.233410
Texas   0.727098  0.605009  0.015713
Oregon -0.136636  1.229721 -0.298551

In [339]:
np.abs(frame)

               b         d         e
Utah    0.429065  0.067477  1.174635
Ohio    0.219946  1.952375  1.233410
Texas   0.727098  0.605009  0.015713
Oregon  0.136636  1.229721  0.298551

In [340]:
 f = lambda x: x.max() - x.min()

In [341]:
 frame.apply(f)

b    0.863734
d    2.019852
e    1.531961
dtype: float64

In [343]:
frame4['DBMS']

0    99
1    78
2    67
3    56
4    64
Name: DBMS, dtype: int64

In [352]:
f = lambda x: [x.max(), x.min()]
frame4.apply(f)
def minMax(x):
    return x.max()
minMax(frame4.DBMS)

99

In [357]:
f = lambda x: [x.max(), x.min(),x.sum()]
frame4[['DBMS']].apply(f)

DBMS    [99, 56, 364]
dtype: object

In [360]:
format = lambda x: print(x)
frame4['DBMS'].map(format)

99
78
67
56
64

0    None
1    None
2    None
3    None
4    None
Name: DBMS, dtype: object

In [361]:
format = lambda x: print(x)
frame4.applymap(format)

1
2
3
4
5
1
2
3
4
5
Shaz
Tazzy
Hanzi
Anda
Shahzaib
50
60
70
80
90
99
78
67
56
64
78
67
98
86
57
300
300
300
300
300
227
205
235
222
211
75.66666666666667%
68.33333333333333%
78.33333333333333%
74.0%
70.33333333333334%
Pass
Pass
Pass
Pass
Pass
B
C
B
B
B

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
0,None,None,None,None,None,None,None,None,None,None
1,None,None,None,None,None,None,None,None,None,None
2,None,None,None,None,None,None,None,None,None,None
3,None,None,None,None,None,None,None,None,None,None
4,None,None,None,None,None,None,None,None,None,None

In [368]:
frame4

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
0,1,Shaz,50,99,78,300,227,75.66666666666667%,Pass,B
1,2,Tazzy,60,78,67,300,205,68.33333333333333%,Pass,C
2,3,Hanzi,70,67,98,300,235,78.33333333333333%,Pass,B
3,4,Anda,80,56,86,300,222,74.0%,Pass,B
4,5,Shahzaib,90,64,57,300,211,70.33333333333334%,Pass,B

In [372]:
format = lambda x: x**2
frame4[['DBMS','D.E']].applymap(format)

   DBMS   D.E
0  9801  2500
1  6084  3600
2  4489  4900
3  3136  6400
4  4096  8100

In [378]:
format = lambda x: np.square(x)
frame4[['DBMS']].applymap(format)

   DBMS
0  9801
1  6084
2  4489
3  3136
4  4096

In [374]:
f1 = lambda x,y: x + y
f1(2,4)

6

In [375]:
 def f(x):
        return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame4.apply(f)

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
min,1,Anda,50,56,57,300,205,68.33333333333333%,Pass,B
max,5,Tazzy,90,99,98,300,235,78.33333333333333%,Pass,C

In [377]:
f2 = lambda x: x.min()
frame4.apply(f2)

Roll no.                           1
Names                           Anda
D.E                               50
DBMS                              56
Dcom                              57
Total                            300
Obtained Marks                   205
Percentage        68.33333333333333%
Remarks                         Pass
Grade                              B
dtype: object

In [380]:
frame4.sort_index(axis = 1)

,D.E,DBMS,Dcom,Grade,Names,Obtained Marks,Percentage,Remarks,Roll no.,Total
0,50,99,78,B,Shaz,227,75.66666666666667%,Pass,1,300
1,60,78,67,C,Tazzy,205,68.33333333333333%,Pass,2,300
2,70,67,98,B,Hanzi,235,78.33333333333333%,Pass,3,300
3,80,56,86,B,Anda,222,74.0%,Pass,4,300
4,90,64,57,B,Shahzaib,211,70.33333333333334%,Pass,5,300

In [381]:
frame4.sort_index(axis = 1, ascending = False)

,Total,Roll no.,Remarks,Percentage,Obtained Marks,Names,Grade,Dcom,DBMS,D.E
0,300,1,Pass,75.66666666666667%,227,Shaz,B,78,99,50
1,300,2,Pass,68.33333333333333%,205,Tazzy,C,67,78,60
2,300,3,Pass,78.33333333333333%,235,Hanzi,B,98,67,70
3,300,4,Pass,74.0%,222,Anda,B,86,56,80
4,300,5,Pass,70.33333333333334%,211,Shahzaib,B,57,64,90

In [393]:
frame4.sort_values(by = 'DBMS')

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
3,4,Anda,80,56,86,300,222,74.0%,Pass,B
4,5,Shahzaib,90,64,57,300,211,70.33333333333334%,Pass,B
2,3,Hanzi,70,67,98,300,235,78.33333333333333%,Pass,B
1,2,Tazzy,60,78,67,300,205,68.33333333333333%,Pass,C
0,1,Shaz,50,99,78,300,227,75.66666666666667%,Pass,B

In [392]:
frame4.sort_values(by = 'DBMS' , ascending = False)

,Roll no.,Names,D.E,DBMS,Dcom,Total,Obtained Marks,Percentage,Remarks,Grade
0,1,Shaz,50,99,78,300,227,75.66666666666667%,Pass,B
1,2,Tazzy,60,78,67,300,205,68.33333333333333%,Pass,C
2,3,Hanzi,70,67,98,300,235,78.33333333333333%,Pass,B
4,5,Shahzaib,90,64,57,300,211,70.33333333333334%,Pass,B
3,4,Anda,80,56,86,300,222,74.0%,Pass,B

In [114]:
obj = pd.Series(range(6), index=['d', 'a', 'b', 'c', '1', 'A'])
obj.sort_index()

1    4
A    5
a    1
b    2
c    3
d    0
dtype: int64

In [115]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                      index=['three', 'one'],
                      columns=['d', 'a', 'b', 'c'])

In [116]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [117]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [118]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [119]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [120]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [121]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [122]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [127]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.sort_values(inplace=True)

In [128]:
obj.rank()

1    1.0
5    2.0
4    3.0
3    4.5
6    4.5
0    6.5
2    6.5
dtype: float64

In [129]:
obj.rank(method='first')

1    1.0
5    2.0
4    3.0
3    4.0
6    5.0
0    6.0
2    7.0
dtype: float64

In [130]:
 obj.rank(ascending=False, method='max')

1    7.0
5    6.0
4    5.0
3    4.0
6    4.0
0    2.0
2    2.0
dtype: float64

In [131]:
 obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [132]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [133]:
 obj.index.is_unique

False

In [134]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [135]:

df

          0         1         2
a  0.260986 -2.013663  0.204048
a  1.771940  0.095257 -0.492365
b -0.138085  0.471200  1.178377
b  1.466637  1.067282  1.297838

In [136]:
df.loc['b']

          0         1         2
b -0.138085  0.471200  1.178377
b  1.466637  1.067282  1.297838

In [137]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],   
                   index=['a', 'b', 'c', 'd'],
                   columns=['one', 'two'])

In [138]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [139]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [140]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [141]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [142]:
 df.idxmax()

one    b
two    d
dtype: object

In [143]:
 df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [144]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [146]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [147]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object